{
  "programs": {
    "general_description": "La filière informatique de l'Université de Kara offre plusieurs formations destinées à former des professionnels dans les domaines du numérique et de la cybersécurité. Actuellement, l'université propose une Licence Professionnelle en Informatique, avec des spécialités en Développement Web et Mobile (LPDM) ainsi qu'en Sécurité Informatique et Cybersécurité (LPSIC). Ces programmes visent à répondre aux besoins croissants dans les secteurs du développement web, de la cybersécurité, des télécommunications et de l'administration des bases de données.",
    "specialties": [
      "Développeur web et mobile",
      "Webmaster",
      "Webdesigner",
      "Analyste programmeur",
      "Administrateur de réseaux et de bases de données"
    ],
    "certifications": ["Cisco (CCNA)", "Microsoft (MCSE, MCSA)"]
  },
  "admissions": {
    "requirements": "Baccalauréat requis (séries C, D ou E), présélection sur dossier, concours écrit.",
    "exam_subjects": [
      "mathématiques",
      "logique",
      "anglais",
      "culture générale"
    ],
    "tuition_fees": {
      "yearly_fees": "251 500 FCFA pour les étudiants togolais, 351 500 FCFA pour les étudiants de la sous-région, 450 000 FCFA pour les salariés.",
      "extra_fees": "27 000 FCFA pour fournitures, tissus, et matériel de réseau.",
      "payment_terms": "L'écolage se paie en une seule tranche."
    },
    "inscription_process": {
      "online_registration": "Après sélection pour suivre les études à LPROC, les inscriptions en ligne permettent à l'individu d'avoir un compte étudiant et d'être reconnu par l'université de Kara. C'est pendant ce processus que s'effectuera le paiement des UE et autres.",
      "definitive_registration": "L'étudiant doit déposer les pièces suivantes à la DASS : fiche d'achat d'UE, fiche d'UE, reçu de paiement, etc."
    }
  },
  "academic_info": {
    "course_format": {
      "in_person": "Les cours se déroulent en présentiel dans les salles de classe, principalement à la FAST et parfois au Campus Sud en raison de la disponibilité des salles ou des équipements.",
      "online": "Certains cours se déroulent en ligne via la plateforme BigBlueButton, où les étudiants se connectent avec leurs comptes étudiants créés par le personnel administratif.",
      "evaluation_methods": [
        "Examens écrits",
        "Quiz",
        "Devoirs",
        "Projets de fin de cours"
      ]
    },
    "required_pc_specs": {
      "minimum": "CPU: Intel Core i5 ou AMD Ryzen 5, RAM: 8 Go, Stockage: 256 Go SSD ou 500 Go HDD, GPU intégré Intel HD.",
      "recommended": "CPU: Intel Core i5 ou AMD Ryzen 5, RAM: 16 Go, Stockage: 256 Go SSD, GPU: NVIDIA GTX ou équivalent.",
      "optimal": "CPU: Intel Core i7 ou AMD Ryzen 7, RAM: 32 Go, Stockage: 512 Go SSD, GPU: NVIDIA RTX ou équivalent."
    },
    "first_year_program": {
      "semester_1": [
        "Anglais Informatique",
        "Environnement économique",
        "Introduction au système Informatique",
        "Conception de Document et interface numérique",
        "Algorithmes, structure de données et Programmation",
        "Introduction aux Bases de Données",
        "Mathématique Discrète",
        "Algèbre Linéaire",
        "Fonctionnement des Organisations"
      ],
      "semester_2": [
        "Communiquer en anglais",
        "Architectures et programmation des mécanismes de base d'un système informatique",
        "Architecture des Réseaux",
        "Maintenance et étude des équipements informatiques",
        "Base de conception et programmation orientée objet",
        "Structure de données et algorithmes fondamentaux",
        "Programmation et administration des bases de données",
        "Gestion de Projets Informatique",
        "Analyse et Méthodes numériques"
      ]
    },
    "course_duration": "La formation s'étend sur 3 ans pour la licence professionnelle.",
    "clubs_and_activities": [
      "Les étudiants en informatique peuvent participer à des compétitions ou des hackathons."
    ],
    "special_courses": [
      "Cours de sciences mathématiques (algèbre, arithmétique, etc.)",
      "Cours d'anglais"
    ]
  },
  "student_life": {
    "dress_code": {
      "description": "Les étudiants doivent respecter un code vestimentaire strict à LPSIC-LPDM.",
      "details": {
        "weekdays": "Chemise blanche sur du cendré tous les Lundi, Mercredi et Vendredi.",
        "other_days": "Port du Lacoste les autres jours.",
        "weekends": "Tenues bigarrées autorisées pendant les weekends.",
        "footwear": "Chaussures classiques recommandées, pas de sandales ou tongs."
      }
    },
    "canteen": "L'université dispose d'une cantine au Campus Sud. La FAST ne dispose pas de cantine connue, mais des vendeuses sont présentes pour fournir des repas.",
    "transport": {
      "bus_stops": [
        "Campus Sud",
        "Total Kara Sud",
        "Shell 1",
        "SOS",
        "Immeuble Tagba",
        "Palais des Congrès",
        "Shell 2",
        "Bohou",
        "Tchitchao"
      ],
      "bus_schedule": [
        "5h30",
        "6h30",
        "7h30",
        "12h30",
        "13h",
        "14h",
        "17h30",
        "18h",
        "18h30"
      ],
      "ticket_price": "150 FCFA par trajet",
      "boarding_info": "Avant l'arrivée du bus, assurez-vous d'avoir vos tickets avant de monter."
    }
  },
  "support": {
    "student_assistance": {
      "course_help": "En cas de difficulté, approchez vos camarades ou les grands frères des années supérieures pour des explications.",
      "teacher_help": "Les enseignants sont là pour vous aider. N'hésitez pas à poser des questions en classe ou après le cours."
    },
    "online_resources": [
      "Coursera",
      "Stack Overflow",
      "FreeCodeCamp",
      "OpenClassrooms",
      "W3Schools"
    ],
    "library_services": {
      "location": "Campus Sud",
      "resources": ["Ouvrages physiques", "Accès internet", "E-books"]
    },
    "internships": {
      "availability": "Des stages sont possibles en deuxième et troisième année de formation.",
      "process": "Obtenez des recommandations pour des stages ou des projets auprès des enseignants ou du secrétariat de la faculté."
    },
    "scholarships": {
      "availability": "Bourses disponibles pour les meilleurs étudiants, dépendant des offres du gouvernement.",
      "eligibility": "Conditions d'éligibilité basées sur la performance académique."
    }
  },
  "practical_info": {
    "wifi": {
      "login_info": {
        "username": "session",
        "password": "session2021"
      },
      "instructions": "Pour se connecter au Wi-Fi de l'université, cherchez un point d'accès proche et suivez les instructions sur la page captif."
    },
    "exam_results": "Les résultats des examens peuvent être consultés en ligne sur le site www.daas.univkara.net/ue.php.",
    "course_materials": {
      "sources": [
        "Bibliothèque universitaire",
        "Plateformes d'apprentissage en ligne"
      ],
      "additional_info": "Les professeurs partagent parfois des documents sur des plateformes spécifiques pour chaque cours."
    }
  },
  "important_contacts": {
    "president": {
      "name": "Professeur Kokou Tchariè",
      "role": "Président actuel de l'Université de Kara, mathématicien reconnu."
    },
    "faculty_dean": {
      "name": "Professeur Kou'santa Amouzou",
      "role": "Doyen de la Faculté des Sciences et Techniques (FAST) de l'Université de Kara."
    },
    "pedagogical_head": {
      "name": "Dr. TIEBEKABE Pagdame",
      "role": "Responsable pédagogique de LPSIC-LPDM, enseignant chercheur en Algèbre Linéaire."
    },
    "department_head": {
      "name": "Chef du Département des Mathématiques",
      "role": "Responsable des cours de mathématiques."
    }
  },
  "definitions": {
    "LPSIC": "Licence Professionnelle en Sécurité Informatique et Cybersécurité.",
    "LPDM": "Licence Professionnelle en Développement Web et Mobile.",
    "FAST": "Faculté des Sciences et Technologies."
  }
}
